In [1]:
import pandas as pd
import numpy as np

In [4]:
sozlukVerisi = {"Istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmir": [40,39,38]}
havaDurumuDataFrame = pd.DataFrame(sozlukVerisi)

In [5]:
havaDurumuDataFrame

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [11]:
havaDurumuDataFrame.dropna() # NaN varsa komple satırı çıkarır

   Istanbul  Ankara  Izmir
0      30.0    20.0     40

In [12]:
havaDurumuDataFrame.dropna(axis=1)

   Izmir
0     40
1     39
2     38

In [19]:
yeniVeri = {"Istanbul" : [30,29,np.nan], "Ankara" : [20,np.nan,25], "Izmir": [40,39,38], "Antalya": [40,np.nan,np.nan]}
yeniDataFrame = pd.DataFrame(yeniVeri)

In [20]:
yeniDataFrame

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     40.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

In [21]:
yeniDataFrame.dropna(axis=1,thresh=2)
# thresh=x, x ve üzeri nan olanları atar

   Istanbul  Ankara  Izmir
0      30.0    20.0     40
1      29.0     NaN     39
2       NaN    25.0     38

In [22]:
yeniDataFrame.fillna(20)

   Istanbul  Ankara  Izmir  Antalya
0      30.0    20.0     40     40.0
1      29.0     NaN     39      NaN
2       NaN    25.0     38      NaN

## groupby

In [23]:
maasSozlugu = {"Departman" : ["Yazılım", "Satış", "Pazarlama", "Finans", "İnsan Kaynakları","Hukuk"],
              "Çalışan İsmi" : ["Ahmet", "Mehmet","Atil","Burak","Zeynep","Fatma"],
               "Maas" : [100,150,200,300,400,500]
              }

In [24]:
maasDataFrame = pd.DataFrame(maasSozlugu)

In [26]:
maasDataFrame

          Departman Çalışan İsmi  Maas
0           Yazılım        Ahmet   100
1             Satış       Mehmet   150
2         Pazarlama         Atil   200
3            Finans        Burak   300
4  İnsan Kaynakları       Zeynep   400
5             Hukuk        Fatma   500

In [27]:
grupObjesi = maasDataFrame.groupby("Departman")

In [29]:
grupObjesi.count()

                  Çalışan İsmi  Maas
Departman
Finans                       1     1
Hukuk                        1     1
Pazarlama                    1     1
Satış                        1     1
Yazılım                      1     1
İnsan Kaynakları             1     1

In [30]:
grupObjesi.mean()

                  Maas
Departman
Finans             300
Hukuk              500
Pazarlama          200
Satış              150
Yazılım            100
İnsan Kaynakları   400

In [31]:
grupObjesi.describe()

                  Maas
                 count   mean std    min    25%    50%    75%    max
Departman
Finans             1.0  300.0 NaN  300.0  300.0  300.0  300.0  300.0
Hukuk              1.0  500.0 NaN  500.0  500.0  500.0  500.0  500.0
Pazarlama          1.0  200.0 NaN  200.0  200.0  200.0  200.0  200.0
Satış              1.0  150.0 NaN  150.0  150.0  150.0  150.0  150.0
Yazılım            1.0  100.0 NaN  100.0  100.0  100.0  100.0  100.0
İnsan Kaynakları   1.0  400.0 NaN  400.0  400.0  400.0  400.0  400.0